#include<stdio.h>
int main(){
    int one, two, three, four, five, six, seven;
    int last_2 = 0, first_3 = 0, last_3 = 0, near_1 = 0, near_2 = 0;
    int money = 0;
    scanf("%d\n%d\n%d\n%d\n%d\n%d\n%d", &one, &two, &three, &four, &five, &six, &seven);
    last_2 += seven % 100;
    first_3 += seven / 1000;
    last_3 += seven % 1000;
    if(one == 000000){
        near_1 += 000001;
        near_2 += 999999;
    }
    else if(one == 999999){
        near_1 += 000000;
        near_2 += 999998;
    }
    else{
        near_1 += one+1;
        near_2 += one-1;
    }
    if(seven == one){
        money += 6000000;
    }
    if(last_2 == two){
        money += 2000;
    }
    if(three == first_3){
        money += 4000;
    }
    if(four == first_3){
        money += 4000;
    }
    if(five == last_3){
        money += 4000;
    }
    if(six == last_3){
        money += 4000;
    }
    if (seven == near_1 || seven == near_2)
    {
        money += 100000;
    }
    printf("%d", money);
    return 0;
}   
//[Extra] Lotto
/* 
มาตรวจหวย (สลากกินแบ่งรัฐบาล) กัน แต่เพื่อความง่าย เราจะตัดรางวัลที่ 2-5 ทิ้งไป ตรวจแค่รางวัลที่ 1 (มี 1 จำนวน) เลขหน้า 3 ตัว (มี 2 จำนวน)  เลขท้าย 3 ตัว (มี 2 จำนวน)  เลขท้าย 2 ตัว (มี 1 จำนวน)  และรางวัลข้างเคียงรางวัลที่ 1 (มี 2 จำนวน) ถ้าซื้อสลากมา 1 ใบ จงหาว่าถูกรางวัลได้เงินทั้งหมดกี่บาท
*สามารถถูกหลายๆรางวัลพร้อมกันได้ เช่น ได้รางวัลที่ 1 รางวัลเลขท้าย 2 ตัว พร้อมกันได้
*เงินรางวัลของแต่รางวัลดูได้ในรูปข้างบน
Hint: กรณีรางวัลที่ 1 เป็น 000000 รางวัลข้างเคียงรางวัลที่ 1 จะเป็น 000001 และ 999999 และถ้ารางวัลที่ 1 เป็น 999999 รางวัลข้างเคียงรางวัลที่ 1 จะเป็น 999998 และ 000000 กรณีอื่นที่คล้ายกันก็เช่นเดียวกัน
 Sample Input    Sample Output
 
    516461           6000
    46
    589
    713
    215
    560
    589046
    889720          104000
    46
    200
    713
    719
    560
    889719
